examples/docker_executor/experiments/exp1_backend_comparison/baseline/qwen3_8b/4_docker_mp_tp2_bench.txt
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fc0eaba1d00>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='sharegpt', no_stream=False, dataset_path='/home/thd/repositories/vllm-dev/vllm-source/examples/docker_executor/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, disable_tqdm=False, num_warmups=3, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-6f4675e2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 3 requests...
100%|██████████| 3/3 [00:01<00:00,  2.21it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [01:43<00:00,  9.69it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Bad Request
Error 1: Bad Request
Error 2: Bad Request
Error 3: Bad Request
Error 4: Bad Request
Error 5: Bad Request
Error 6: Bad Request
Error 7: Bad Request
Error 8: Bad Request
Error 9: Bad Request
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     700       
Failed requests:                         300       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  103.23    
Total input tokens:                      82224     
Total generated tokens:                  109584    
Request throughput (req/s):              6.78      
Output token throughput (tok/s):         1061.53   
Peak output token throughput (tok/s):    3152.00   
Peak concurrent requests:                68.00     
Total token throughput (tok/s):          1858.03   
---------------Time to First Token----------------
Mean TTFT (ms):                          299.30    
Median TTFT (ms):                        34.84     
P99 TTFT (ms):                           5748.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.62     
Median TPOT (ms):                        9.91      
P99 TPOT (ms):                           49.96     
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.72     
Median ITL (ms):                         9.44      
P99 ITL (ms):                            31.78     
==================================================